app/controllers/doses_controller.rb

SELECT "doses".* FROM "doses"
---
  def index
    @dose = Dose.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    # render json: @dose, include: :pill

    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "doses" ("user_id", "pill_id", "am_dose", "mid_dose", "pm_dose", "bed_dose", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["user_id", 7], ["pill_id", 3], ["am_dose", "1"], ["mid_dose", "1"], ["pm_dose", "1"], ["bed_dose", "1"], ["created_at", "2019-05-06 20:34:52.252046"], ["updated_at", "2019-05-06 20:34:52.252046"]]
INSERT INTO "doses" ("user_id", "pill_id", "am_dose", "mid_dose", "pm_dose", "bed_dose", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["user_id", 7], ["pill_id", 2], ["am_dose", "3"], ["mid_dose", "3"], ["pm_dose", "3"], ["bed_dose", "3"], ["created_at", "2019-05-08 14:04:38.379303"], ["updated_at", "2019-05-08 14:04:38.379303"]]
---
  def create
    if params[:user_id]
      @dose = Dose.new(dose_params)
      @user = User.find(params[:user_id])
      @user.doses << @dose
      if @dose.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "doses" SET "am_dose" = $1, "mid_dose" = $2, "pm_dose" = $3, "bed_dose" = $4, "updated_at" = $5 WHERE "doses"."id" = $6  [["am_dose", "5"], ["mid_dose", "5"], ["pm_dose", "5"], ["bed_dose", "5"], ["updated_at", "2019-05-08 14:25:41.859529"], ["id", 5]]
SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    if params[:user_id]
      @user = User.find(params[:user_id])
      @dose = Dose.find(params[:id])
      @dose.update(dose_params)
      render json: @user, include: :doses
    elsif params[:id]
      @dose = Dose.find(params[:id])

DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 4]]
---
  def destroy
    @dose.destroy

SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_dose
      @dose = Dose.find(params[:id])