app/controllers/pills_controller.rb

SELECT "pills".* FROM "pills"
---
  def index
    @pills = Pill.all

SELECT  "pills".* FROM "pills" WHERE "pills"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_pill
      @pill = Pill.find(params[:id])